In [4]:
import pandas as pd

In [6]:
%store -r titanic_m_df

In [2]:
titanic_m_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
18,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
19,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
20,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
21,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
903,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
904,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
905,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
906,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
907,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### Exercise 6.1: Demonstrate apply function

In [87]:
def my_apply_func(x):
    print(x,"\n")
    return(x)

small_subdataset = titanic_m_df.iloc[:2,]
small_subdataset.apply( my_apply_func, axis = 1)

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                        dazdranagon
Age                        dazdranagon
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 17, dtype: object

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                        dazdranagon
Age                        dazdranagon
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 17, dtype: object

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                  dazdranagon
Age                                                  dazdranagon
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 18, dtype: object

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,1,0,3,"Braund, Mr. Owen Harris",dazdranagon,dazdranagon,1,0,A/5 21171,7.2500,NaN,S
18,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",dazdranagon,dazdranagon,1,0,PC 17599,71.2833,C85,C

In [111]:
titanic_m_df.apply(lambda row : " ".join(row.astype(sstr)), axis =1)

17     1 0 3 harbour.space harbour.space 22.0 1 0 A/5...
18     2 1 1 harbour.space harbour.space 38.0 1 0 PC ...
19     3 1 3 dazdranagon dazdranagon 26.0 0 0 STON/O2...
20     4 1 1 Futrelle, Mrs. Jacques Heath (Lily May P...
21     5 0 3 Allen, Mr. William Henry male 39.0 0 0 3...
                             ...
903    887 0 2 Montvila, Rev. Juozas male 31.0 0 0 21...
904    888 1 1 Graham, Miss. Margaret Edith female 19...
905    889 0 3 Johnston, Miss. Catherine Helen "Carri...
906    890 1 1 Behr, Mr. Karl Howell male 30.0 0 0 11...
907    891 0 3 Dooley, Mr. Patrick male 36.0 0 0 3703...
Length: 891, dtype: object

#### Exercise 6.2: Use apply function to extract data

In [1]:
def is_there_a_mrs_in_the_string(input_str):
    if 'Mrs.' in input_str:
        return True
    else:
        return False

In [2]:
is_there_a_mrs_in_the_string("Here's To You, Mrs. Anderson")

True

In [3]:
is_there_a_mrs_in_the_string("Overly manly statement without any mention of women")

False

In [7]:
titanic_m_df['Name'].apply(is_there_a_mrs_in_the_string)

17     False
18      True
19     False
20      True
21     False
       ...
903    False
904    False
905    False
906    False
907    False
Name: Name, Length: 891, dtype: bool

#### Exercise 6.3: Apply to column, row, and subdataframe

In [10]:
titanic_m_df['Name'].apply(lambda x: str(x) + "_trace_of_intelligent_life")

17     Braund, Mr. Owen Harris_trace_of_intelligent_life
18     Cumings, Mrs. John Bradley (Florence Briggs Th...
19      Heikkinen, Miss. Laina_trace_of_intelligent_life
20     Futrelle, Mrs. Jacques Heath (Lily May Peel)_t...
21     Allen, Mr. William Henry_trace_of_intelligent_...
                             ...
903      Montvila, Rev. Juozas_trace_of_intelligent_life
904    Graham, Miss. Margaret Edith_trace_of_intellig...
905    Johnston, Miss. Catherine Helen "Carrie"_trace...
906      Behr, Mr. Karl Howell_trace_of_intelligent_life
907        Dooley, Mr. Patrick_trace_of_intelligent_life
Name: Name, Length: 891, dtype: object

In [15]:
titanic_m_df.iloc[17].apply(lambda x: str(x) + "_trace_of_intelligent_life")

PassengerId                         18_trace_of_intelligent_life
Survived                             1_trace_of_intelligent_life
Pclass                               2_trace_of_intelligent_life
Name           Williams, Mr. Charles Eugene_trace_of_intellig...
Sex                               male_trace_of_intelligent_life
Age                                nan_trace_of_intelligent_life
SibSp                                0_trace_of_intelligent_life
Parch                                0_trace_of_intelligent_life
Ticket                          244373_trace_of_intelligent_life
Fare                              13.0_trace_of_intelligent_life
Cabin                              nan_trace_of_intelligent_life
Embarked                             S_trace_of_intelligent_life
Name: 34, dtype: object

In [20]:
titanic_m_df.iloc[17:19].apply(lambda x: str(x) + "_trace_of_intelligent_life", axis =0)

PassengerId    34    18\n35    19\nName: PassengerId, dtype: ...
Survived       34    1\n35    0\nName: Survived, dtype: objec...
Pclass         34    2\n35    3\nName: Pclass, dtype: object_...
Name           34                         Williams, Mr. Charl...
Sex            34      male\n35    female\nName: Sex, dtype: ...
Age            34    NaN\n35     31\nName: Age, dtype: object...
SibSp          34    0\n35    1\nName: SibSp, dtype: object_t...
Parch          34    0\n35    0\nName: Parch, dtype: object_t...
Ticket         34    244373\n35    345763\nName: Ticket, dtyp...
Fare           34    13\n35    18\nName: Fare, dtype: object_...
Cabin          34    NaN\n35    NaN\nName: Cabin, dtype: obje...
Embarked       34    S\n35    S\nName: Embarked, dtype: objec...
dtype: object

In [21]:
titanic_m_df.iloc[17:19].apply(lambda x: str(x) + "_trace_of_intelligent_life", axis =1)

34    PassengerId                              18\nS...
35    PassengerId                                   ...
dtype: object